Обработки/Reports/_КонтрольОтчетностиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КонтрольОтчетностиЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КонтрольОтчетностиЦБ/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	
	ДобавитьТаблицуНастроек();
	
	РеквизитФормыОтчет = РеквизитФормыВЗначение("Отчет");
	НастройкиВидимостиРеквизитов	= РеквизитФормыОтчет.ПолучитьНастройкиВидимостиРеквизитов();
	
	ЗаголовкиПоУмолчанию = Новый Структура;
	Для Каждого Элемент Из Элементы Цикл
		ЗаголовкиПоУмолчанию.Вставить(Элемент.Имя, Элемент.Заголовок);
	КонецЦикла;	
	
	ЗаполнитьВариантыКонтроля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВариантОтчетаПриИзменении("");	
	
	ЭтаФорма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;

КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполнения()

	Отказ = Ложь;
	
	ОбязательныеРеквизиты	= Новый Структура;
	ИспользуемыеКаталоги	= Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(Отчет.ВариантОтчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Вариант отчета"" не заполнено",,, "Отчет.ВариантОтчета", Отказ);
	КонецЕсли;
	
	Если Элементы.ИмяФайла.Видимость Тогда
		ОбязательныеРеквизиты.Вставить("ИмяФайла",	"Имя файла");
		ИспользуемыеКаталоги.Вставить("ИмяФайла",	"Имя файла");
	КонецЕсли;
	
	Если Элементы.ИмяФайлаПредыдущегоПериода.Видимость Тогда
		ОбязательныеРеквизиты.Вставить("ИмяФайлаПредыдущегоПериода", "Имя файла предыдущего периода");
		ИспользуемыеКаталоги.Вставить("ИмяФайлаПредыдущегоПериода",	"Имя файла предыдущего периода");
	КонецЕсли;
	
	Для Каждого Реквизит Из ОбязательныеРеквизиты Цикл
		Если НЕ ЗначениеЗаполнено(ЭтаФорма[Реквизит.Ключ]) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле """ + Реквизит.Значение + """ не заполнено",,, Реквизит.Ключ, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит Из ИспользуемыеКаталоги Цикл
		Каталог = Новый Файл(ЭтаФорма[Реквизит.Ключ]);
		Если НЕ Каталог.Существует() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Каталог указанный в поле """ + Реквизит.Значение + """ не обнаружен",,, Реквизит.Ключ, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции

&НаКлиенте
Процедура ВидимостьРеквизитов()
	
	//видимость задаётся в макете ВидимостьРеквизитов
	
	Если ЗначениеЗаполнено(Отчет.ВариантОтчета) Тогда
		Если НастройкиВидимостиРеквизитов.Свойство(Отчет.ВариантОтчета) Тогда
			Для Каждого НастройкаВидимости Из НастройкиВидимостиРеквизитов[Отчет.ВариантОтчета] Цикл
				Если ТипЗнч(НастройкаВидимости.Значение.Видимость) = Тип("Булево") Тогда
					Элементы[НастройкаВидимости.Ключ].Видимость = НастройкаВидимости.Значение.Видимость;
				Иначе
					Элементы[НастройкаВидимости.Ключ].Видимость = ЭтаФорма[НастройкаВидимости.Значение.Видимость];
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НастройкаВидимости.Значение.Заголовок) Тогда
					Элементы[НастройкаВидимости.Ключ].Заголовок = НастройкаВидимости.Значение.Заголовок;
				Иначе
					Элементы[НастройкаВидимости.Ключ].Заголовок = ЗаголовкиПоУмолчанию[НастройкаВидимости.Ключ];
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Страница Из Элементы.ГруппаПечатныеФормы.ПодчиненныеЭлементы Цикл
		Если Страница.Видимость Тогда
			Элементы.ГруппаПечатныеФормы.ТекущаяСтраница = Страница;	
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияРеквизитовФормы

&НаКлиенте
Процедура ВариантОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СохранитьДанныеВНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	
	ВосстановитьДанныеИзНастроек(Отчет.ВариантОтчета);	
	ВидимостьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	СохранитьДанныеВНастройки();
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");	
	
	ВосстановитьДанныеИзНастроек(Отчет.ВариантОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр				= "XML (*.xml)|*.xml";
	
	ВыбранныйФайл = Новый Файл(ЭтаФорма[Элемент.Имя]);
	Если ВыбранныйФайл.Существует() Тогда
		Диалог.Каталог = ВыбранныйФайл.Путь;
	КонецЕсли;
	
	Диалог.ПолноеИмяФайла		= ЭтаФорма[Элемент.Имя];
	Диалог.МножественныйВыбор	= Ложь; 
	Диалог.Заголовок			= Элемент.Заголовок; 
	
	Если Диалог.Выбрать() Тогда 
		ЭтаФорма[Элемент.Имя] = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ЭтаФорма[Элемент.Имя]);
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ВыполнитьКонтроль(Команда)
	
	Отказ = Ложь;
	
	Если Не ПроверкаЗаполнения() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКоманды = Новый Структура("Отказ", Ложь);
	ПараметрыКоманды.Вставить("ВариантОтчета",	Отчет.ВариантОтчета);
	ПараметрыКоманды.Вставить("Период",			Отчет.Период);
	ПараметрыКоманды.Вставить("Организация",	Отчет.Организация);
	
	Если Элементы.ИмяФайла.Видимость Тогда
		ПараметрыКоманды.Вставить("РеквизитыФайла", УпаковатьФайл("ИмяФайла"));
	КонецЕсли;
			
	Если Элементы.ИмяФайлаПредыдущегоПериода.Видимость Тогда
		ПараметрыКоманды.Вставить("РеквизитыФайлаПредыдущегоПериода", УпаковатьФайл("ИмяФайлаПредыдущегоПериода"));
	КонецЕсли;
	
	ВыполнитьКонтрольНаСервере(ПараметрыКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКонтрольНаСервере(ПараметрыКоманды)
	
	ЭтаФорма.Результат.Очистить();
	ЭтаФорма.Расшифровка.Очистить();
	
	РеквизитФормыВЗначение("Отчет").ВыполнитьКонтроль(ПараметрыКоманды);
	
	Если ПараметрыКоманды.Свойство("Результат") Тогда
		ЭтаФорма.Результат.Вывести(ПараметрыКоманды.Результат);
	КонецЕсли;
	
	Если ПараметрыКоманды.Свойство("Расшифровка") Тогда
		ЭтаФорма.Расшифровка.Вывести(ПараметрыКоманды.Расшифровка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция УпаковатьФайл(ИмяРеквизита)
	
	РеквизитыФайла = Новый Структура();
	РеквизитыФайла.Вставить("АдресФайла"	, ЭтаФорма[ИмяРеквизита]);
	РеквизитыФайла.Вставить("АдресФайлаВХ"	, ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ЭтаФорма[ИмяРеквизита]), ЭтаФорма.УникальныйИдентификатор));
	РеквизитыФайла.Вставить("ИмяРеквизита"	, ИмяРеквизита);
	
	Возврат РеквизитыФайла;
	
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедуры

&НаСервере
Процедура ЗаполнитьВариантыКонтроля()

	Для Каждого НастройкаВидимости Из НастройкиВидимостиРеквизитов Цикл
		Элементы.ВариантОтчета.СписокВыбора.Добавить(НастройкаВидимости.Ключ, НастройкаВидимости.Значение.Представление);
		НастройкаВидимости.Значение.Удалить("Представление");
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ВидимостьРеквизита(ИмяРеквизита)
	
	Элемент = Элементы[ИмяРеквизита];
	Пока ТипЗнч(Элемент) = Тип("ГруппаФормы") ИЛИ ТипЗнч(Элемент) = Тип("ПолеФормы") Цикл
		Если НЕ Элемент.Видимость Тогда
			Возврат Ложь;
		КонецЕсли;
		Элемент = Элемент.Родитель;
	КонецЦикла;	
		
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СохранениеНастроек

&НаСервере
Процедура ДобавитьТаблицуНастроек()
	
	ПустаяТаблицаЗначений = Новый ТаблицаЗначений;
	ПустаяТаблицаЗначений.Колонки.Добавить("Организация",	Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ПустаяТаблицаЗначений.Колонки.Добавить("Ключ",			Новый ОписаниеТипов("Строка"));
	ПустаяТаблицаЗначений.Колонки.Добавить("Значение");
	ПустаяТаблицаЗначений.Колонки.Добавить("ВариантОтчета", Новый ОписаниеТипов("Строка"));
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НастройкиФормы", Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина));
	
	Для Каждого Колонка Из ПустаяТаблицаЗначений.Колонки Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "НастройкиФормы"));	
	КонецЦикла;
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СохраняемыеРеквизиты", Новый ОписаниеТипов));	
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЭтаФорма.СохраняемыеРеквизиты = ПолучитьСохраняемыеРеквизиты(); 
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеВНастройки()
	
	СохраненныеНастройки = ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы + "/ТекущиеДанные");
	Если СохраненныеНастройки <> Неопределено И СохраненныеНастройки.Получить("НастройкиФормы") <> Неопределено Тогда
		ЭтаФорма.НастройкиФормы.Загрузить(СохраненныеНастройки.Получить("НастройкиФормы"));
	КонецЕсли;
	
	СохранитьНастройкиВТаблицу(ЭтаФорма.НастройкиФормы);
	
	СохраненныеНастройки = ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы + "/ТекущиеДанные");
		
	Если СохраненныеНастройки = Неопределено Тогда
		СохраненныеНастройки = Новый Соответствие;
	КонецЕсли;
	
	СохраненныеНастройки.Вставить("НастройкиФормы", ЭтаФорма.НастройкиФормы.Выгрузить());
	ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы + "/ТекущиеДанные", "", СохраненныеНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьДанныеИзНастроек(ВариантОтчета)
	
	СохраненныеНастройки = ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы + "/ТекущиеДанные");
	Если СохраненныеНастройки <> Неопределено И СохраненныеНастройки.Получить("НастройкиФормы") <> Неопределено Тогда
		ЭтаФорма.НастройкиФормы.Загрузить(СохраненныеНастройки.Получить("НастройкиФормы"));
	КонецЕсли;
	
	СохраняемыеРеквизиты = Новый Структура;
	
	Для Каждого СтрокаНастройки Из ЭтаФорма.НастройкиФормы Цикл
		Если СтрокаНастройки.Организация = Отчет.Организация И СтрокаНастройки.ВариантОтчета = ВариантОтчета Тогда
			Если ЗначениеЗаполнено(СтрокаНастройки.Значение) Тогда
				СохраняемыеРеквизиты.Вставить(СтрокаНастройки.Ключ, СтрокаНастройки.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Отчет		, СохраняемыеРеквизиты);
	ЗаполнитьЗначенияСвойств(ЭтаФорма	, СохраняемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	СохраненныеНастройки = ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы + "/ТекущиеДанные");
	Если СохраненныеНастройки <> Неопределено И СохраненныеНастройки.Получить("НастройкиФормы") <> Неопределено Тогда
		ПерНастройкиФормы = СохраненныеНастройки.Получить("НастройкиФормы");
	Иначе
		ПерНастройкиФормы = ЭтаФорма.НастройкиФормы.Выгрузить();//Настройки.Получить("НастройкиФормы");
	КонецЕсли;
	
	СохранитьНастройкиВТаблицу(ПерНастройкиФормы);
	
	Настройки.Вставить("НастройкиФормы", ПерНастройкиФормы);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиВТаблицу(ПерНастройкиФормы)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма.СохраняемыеРеквизиты, Отчет);
	ЗаполнитьЗначенияСвойств(ЭтаФорма.СохраняемыеРеквизиты, ЭтаФорма);
	
	ПараметрыПоиска = Новый Структура("Организация,ВариантОтчета", Отчет.Организация, Отчет.ВариантОтчета);
	НайденныеСтроки = ПерНастройкиФормы.НайтиСтроки(ПараметрыПоиска);
	Для Каждого СтрокаНастройки Из НайденныеСтроки Цикл
		ПерНастройкиФормы.Удалить(СтрокаНастройки);
	КонецЦикла;
	
	Для Каждого Реквизит Из ЭтаФорма.СохраняемыеРеквизиты Цикл
		СтрокаНастройки = ПерНастройкиФормы.Добавить();
		СтрокаНастройки.Организация		= Отчет.Организация;
		СтрокаНастройки.ВариантОтчета	= Отчет.ВариантОтчета;
		СтрокаНастройки.Ключ			= Реквизит.Ключ;
		СтрокаНастройки.Значение		= Реквизит.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСохраняемыеРеквизиты()

	СохраняемыеРеквизиты = Новый Структура;
	СохраняемыеРеквизиты.Вставить("ИмяФайла");
	СохраняемыеРеквизиты.Вставить("ИмяФайлаПредыдущегоПериода");
	
	Возврат СохраняемыеРеквизиты;

КонецФункции

#КонецОбласти
